[Killed] EqualityOperator
main/pages/Meal/MealTimesPage.jsx:29:7
     navigate(`/diningcommons/${newDate}/${diningCommonsCode}`);
   };
 
-  if (status === 204) {
+  if (status !== 204) {
     const message = `${diningCommonsCode} is closed on ${dateTime}. Please select another date or dining common.`;
     toast(message, { toastId: "closed-dining-commons" });
killedBy: MealTimesPage tests displays correct information in the table
statusReason: Unable to find an element with the text: Breakfast. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div>
    <div
      class="d-flex flex-column min-vh-100"
    >

[Killed] ObjectLiteral
main/pages/Meal/MealTimesPage.jsx:31:20
 
   if (status === 204) {
     const message = `${diningCommonsCode} is closed on ${dateTime}. Please select another date or dining common.`;
-    toast(message, { toastId: "closed-dining-commons" });
+    toast(message, {});
     return (
       <BasicLayout>
killedBy: MealTimesPage tests when backend returns 204, displays toast message
statusReason: expected "vi.fn()" to be called with arguments: [ …(2) ]

Received: 

  1st vi.fn() call:

  [
    "portola is closed on 2024-11-25. Please select another date or dining common.",
