[Killed] EqualityOperator
main/components/MenuItem/MenuItemTable.jsx:23:46
       return "No reviews";
     const validRatings = reviews
       .filter(
-        (r) => r && typeof r === "object" && typeof r.itemsStars === "number",
+        (r) => r && typeof r === "object" && typeof r.itemsStars !== "number",
       )
       .map((r) => r.itemsStars);
killedBy: MenuItemTable Tests Renders 5 Menu Items Correctly with ratings
statusReason: expect(element).toHaveTextContent()

Expected element to have text content:
  4.5
Received:
  No ratings
